fonecmid-diplom/src/Documents/ВКМ_НачисленияЗарплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ВКМ_НачисленияЗарплаты</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>CalculationRegister.ВКМ_Удержания</xr:Item>
				<xr:Item>CalculationRegister.ВКМ_ДополнительныеНачисления</xr:Item>
				<xr:Item>CalculationRegister.ВКМ_ОсновныеНачисления</xr:Item>
				<xr:Item>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Начисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРасчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.ВКМ_ОсновныеНачисления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазмерОклад</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

fonecmid-diplom/src/CalculationRegisters/ВКМ_ОсновныеНачисления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<CalculationRegister>
		<Properties>
			<Name>ВКМ_ОсновныеНачисления</Name>
			<Periodicity>Month</Periodicity>
			<ActionPeriod>true</ActionPeriod>
			<BasePeriod>true</BasePeriod>
			<Schedule>InformationRegister.ВКМ_ГрафикиРаботы</Schedule>
			<ScheduleValue>InformationRegister.ВКМ_ГрафикиРаботы.Resource.Значение</ScheduleValue>
			<ScheduleDate>InformationRegister.ВКМ_ГрафикиРаботы.Dimension.Дата</ScheduleDate>
			<ChartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_ОсновныеНачисления</ChartOfCalculationTypes>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтработаноДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтработаноЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
		</ChildObjects>
	</CalculationRegister>
</MetaDataObject>

fonecmid-diplom/src/CalculationRegisters/ВКМ_Удержания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<CalculationRegister>
		<Properties>
			<Name>ВКМ_Удержания</Name>
			<Periodicity>Month</Periodicity>
			<ActionPeriod>false</ActionPeriod>
			<BasePeriod>true</BasePeriod>
			<ChartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_Удержания</ChartOfCalculationTypes>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
		</ChildObjects>
	</CalculationRegister>
</MetaDataObject>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеСотрудникомРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ВКМ_ВыполненныеСотрудникомРаботы</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЧасовКОплате</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКОплате</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВзаиморасчетыССотрудниками.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ВКМ_ВзаиморасчетыССотрудниками</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

fonecmid-diplom/src/Documents/ВКМ_НачисленияЗарплаты/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// 1. Инициализация наборов записей
	Движения.ВКМ_ОсновныеНачисления.Записывать = Истина;
	Движения.ВКМ_Удержания.Записывать = Истина;
	
	Движения.ВКМ_ОсновныеНачисления.Очистить();
	Движения.ВКМ_Удержания.Очистить();
	
	// 2. Подготовка первичных записей в регистр расчета
	Для Каждого СтрокаТЧ Из Начисления Цикл
		
		Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
		Движение.Сотрудник       = СтрокаТЧ.Сотрудник;
		Движение.ВидРасчета      = СтрокаТЧ.ВидРасчета;
		Движение.ПериодРегистрации = НачалоМесяца(Дата);
		
		Движение.ПериодДействияНачало = СтрокаТЧ.ДатаНачала;
		Движение.ПериодДействияКонец  = КонецДня(СтрокаТЧ.ДатаОкончания);
		
		// Настройка базы для Отпуска
		Если СтрокаТЧ.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск Тогда
			Движение.БазовыйПериодНачало = ДобавитьМесяц(СтрокаТЧ.ДатаНачала, -12);
			Движение.БазовыйПериодКонец  = НачалоДня(СтрокаТЧ.ДатаНачала) - 1;
		КонецЕсли;
		
	КонецЦикла;
	
	// Записываем "пустые" движения, чтобы платформа рассчитала ФактическийПериод и Базу
	Движения.ВКМ_ОсновныеНачисления.Записать();
	
	// Подготовка массива измерений для расчета базы (обязательно)
	МассивИзмерений = Новый Массив;
	МассивИзмерений.Добавить("Сотрудник");
	
	// 3. Запрос для получения расчетных данных
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеРегистра.НомерСтроки КАК НомерСтроки,
		|	ДанныеРегистра.ВидРасчета КАК ВидРасчета,
		|	ЕСТЬNULL(ДанныеГрафика.ЗначениеФактическийПериодДействия, 0) КАК ОтработаноДней,
		|	ЕСТЬNULL(ДанныеГрафика.ЗначениеПериодДействия, 0) КАК НормаДней,
		|	ЕСТЬNULL(ДанныеБазы.РезультатБаза, 0) КАК БазаДеньги,
		|	ЕСТЬNULL(ДанныеБазы.ОтработаноДнейБаза, 0) КАК БазаДни,
		|	ЕСТЬNULL(ТЧНачисления.РазмерОклад, 0) КАК РазмерОклад,
		|	ЕСТЬNULL(ОборотыРабот.СуммаКОплатеОборот, 0) КАК СуммаПроцента
		|ИЗ
		|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ДанныеРегистра
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(Регистратор = &Ссылка) КАК ДанныеГрафика
		|		ПО ДанныеРегистра.НомерСтроки = ДанныеГрафика.НомерСтроки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.БазаВКМ_ОсновныеНачисления(&Измерения, &Измерения, , Регистратор = &Ссылка) КАК ДанныеБазы
		|		ПО ДанныеРегистра.НомерСтроки = ДанныеБазы.НомерСтроки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВКМ_НачисленияЗарплаты.Начисления КАК ТЧНачисления
		|		ПО ДанныеРегистра.НомерСтроки = ТЧНачисления.НомерСтроки
		|			И (ТЧНачисления.Ссылка = &Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Обороты(&НачалоМесяца, &КонецМесяца, , ) КАК ОборотыРабот
		|		ПО ДанныеРегистра.Сотрудник = ОборотыРабот.Сотрудник
		|ГДЕ
		|	ДанныеРегистра.Регистратор = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(Дата));
	Запрос.УстановитьПараметр("Измерения", МассивИзмерений);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	// 4. Расчет результатов
	Пока Выборка.Следующий() Цикл
		
		Движение = Движения.ВКМ_ОсновныеНачисления[Выборка.НомерСтроки - 1];
		
		Если Выборка.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад Тогда
			// Формула Оклада
			Если Выборка.НормаДней > 0 Тогда
				Движение.Результат = Выборка.РазмерОклад / Выборка.НормаДней * Выборка.ОтработаноДней;
			КонецЕсли;
			Движение.ОтработаноДней = Выборка.ОтработаноДней;
			
		ИначеЕсли Выборка.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Процент Тогда
			// Формула Процента (РазмерОклад в ТЧ для этой строки — это % премии)
			Движение.Результат = (Выборка.СуммаПроцента * Выборка.РазмерОклад) / 100;
			
		ИначеЕсли Выборка.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск Тогда
			// Формула Отпуска
			Если Выборка.БазаДни > 0 Тогда
				Длительность = (Движение.ПериодДействияКонец - Движение.ПериодДействияНачало + 1) / 86400;
				Движение.Результат = (Выборка.БазаДеньги / Выборка.БазаДни) * Длительность;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	// Записываем финальные результаты начислений
	Движения.ВКМ_ОсновныеНачисления.Записать();
	
	// 5. Расчет НДФЛ
	ЗапросНДФЛ = Новый Запрос(
		"ВЫБРАТЬ
		|	ВКМ_ОсновныеНачисления.Сотрудник КАК Сотрудник,
		|	СУММА(ВКМ_ОсновныеНачисления.Результат) КАК СуммаНачислений
		|ИЗ
		|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
		|ГДЕ
		|	ВКМ_ОсновныеНачисления.Регистратор = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ОсновныеНачисления.Сотрудник");
	ЗапросНДФЛ.УстановитьПараметр("Ссылка", Ссылка);
	ВыборкаНДФЛ = ЗапросНДФЛ.Выполнить().Выбрать();
	
	Пока ВыборкаНДФЛ.Следующий() Цикл
		Если ВыборкаНДФЛ.СуммаНачислений > 0 Тогда
			Движение = Движения.ВКМ_Удержания.Добавить();
			Движение.ПериодРегистрации = НачалоМесяца(Дата);
			Движение.Сотрудник         = ВыборкаНДФЛ.Сотрудник;
			Движение.ВидРасчета        = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
			Движение.Результат         = ВыборкаНДФЛ.СуммаНачислений * 0.13;
		КонецЕсли;
	КонецЦикла;
	
	Движения.ВКМ_Удержания.Записать();   
	
	

Движения.ВКМ_Удержания.Записать();

// --- НОВЫЙ БЛОК: Запись во взаиморасчеты ---
// Нам нужно собрать суммы по Основным начислениям и вычесть Удержания
ЗапросВзаиморасчеты = Новый Запрос;
ЗапросВзаиморасчеты.Текст = 
    "ВЫБРАТЬ
    |	ВКМ_ОсновныеНачисления.Сотрудник КАК Сотрудник,
    |	СУММА(ВКМ_ОсновныеНачисления.Результат) КАК Сумма
    |ПОМЕСТИТЬ ВТ_Итоги
    |ИЗ
    |	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
    |ГДЕ
    |	ВКМ_ОсновныеНачисления.Регистратор = &Ссылка
    |
    |СГРУППИРОВАТЬ ПО
    |	ВКМ_ОсновныеНачисления.Сотрудник
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	ВТ_Итоги.Сотрудник КАК Сотрудник,
    |	ВТ_Итоги.Сумма - ЕСТЬNULL(СУММА(ВКМ_Удержания.Результат), 0) КАК ИтоговаяСумма
    |ИЗ
    |	ВТ_Итоги КАК ВТ_Итоги
    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
    |		ПО ВТ_Итоги.Сотрудник = ВКМ_Удержания.Сотрудник
    |			И (ВКМ_Удержания.Регистратор = &Ссылка)
    |
    |СГРУППИРОВАТЬ ПО
    |	ВТ_Итоги.Сотрудник,
    |	ВТ_Итоги.Сумма";

ЗапросВзаиморасчеты.УстановитьПараметр("Ссылка", Ссылка);
ВыборкаИтог = ЗапросВзаиморасчеты.Выполнить().Выбрать();

Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
Пока ВыборкаИтог.Следующий() Цикл
    Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.ДобавитьПриход();
    Движение.Период = Дата;
    Движение.Сотрудник = ВыборкаИтог.Сотрудник;
    Движение.Сумма = ВыборкаИтог.ИтоговаяСумма;
КонецЦикла;
	
КонецПроцедуры
